/*1. Напишите программу, которая на вход принимает число и выдает его квадрат.*/
Console.Write("Введите число: ");
int num = int.Parse(Console.ReadLine());
int square = num * num;
Console.WriteLine($"Квадрат числа {num} равен {square}.");
